{"podcast_details": {"podcast_title": "CNN Inside Politics", "episode_title": "Why did DA not prosecute Lindsey Graham, others?", "episode_image": "https://www.omnycontent.com/d/playlist/d83f52e4-2455-47f4-982e-ab790120b954/0662f610-d693-473a-b06a-ab86010e979c/8a5860a3-0e13-40eb-93e5-ab86010e97a0/image.jpg?t=1686602416&size=Large", "episode_transcript": " Today on Inside Politics, 39 names. I'm Dana Bash in Washington. The Fulton County Special Grand Jury Report is out and it begs a lot of questions. The biggest one is this. Why did District Attorney Bonnie Willis decide not to prosecute key political figures despite getting a go ahead from a special grand jury? The names in this report read like a who's who of Donald Trump's orbit. Some who were indicted as part of the criminal conspiracy are Rudy Giuliani, Mark Meadows, and John Eastman. Now we are learning some of who were not. Cleta Mitchell, Bert Jones, who's Georgia's Lieutenant Governor now, longtime Trump aide and sometimes attorney Boris Epstein, former Trump National Security Advisor Michael Flynn, and some who serve and also served in the past in the United States Senate. Lindsey Graham, David Perdue, and Kelly Leffler, those last two of course, of Georgia. CNN's Sarah Murray has been closely looking over this newly released report. Sarah, what are you seeing? Well, Dana, obviously the special grand jury felt that very many people deserve to be indicted after they heard months of evidence and heard from 75 witnesses. Again, this is not the grand jury that issued the indictments in this case. This was a grand jury whose job was to investigate and they ultimately felt that 39 people should be indicted. Now the district attorney did not just take that list and take it to a regular grand jury. What prosecutors did is they went through this name by name and they tried to determine, do the facts support a case against this person? Do we believe that we could put this before the regular grand jury, get an indictment, and that we have the evidence to be able to take this person to trial and to succeed? And ultimately you see a lot of these names fall away. Fulton County District Attorney Fonny Willis ended up indicting 19 individuals. 18 of them, including of course former President Donald Trump, were recommended to be indicted by the special purpose grand jury. There was another one who does not show up in that report, Mike Roman, who the district attorney ultimately decided to bring charges against. But I think what you're seeing is the difference between what normal folks, again, just regular people who served on a special purpose grand jury found offensive and thought may be illegal versus what prosecutors felt they could actually prove and bring to trial, Dana. Sarah Murray, thank you so much for that reporting. And here with me at the table, CNN's David Chalien, CNN's Gloria Borger, CNN's Manu Raju, and Julie Hirschfeld Davis of The New York Times. Nice to see you all. A busy Friday, as is typical, I think, in the Trump years. I want to again pull up the list of the 39 that this special grand jury recommended for indictment. And as we talked about before, as you just heard from Sarah, 19 of these, including the former president himself, were actually indicted separately. For our purposes, I want to zero in on three individuals who were not. Lindsey Graham, David Perdue, and Kelly Loeffler. And what is really interesting to me here is that Lindsey Graham, we actually have the breakdown of the grand jury voting. And Lindsey Graham, only 13 of them said yes, seven said no. For David Perdue, it was 17, four said no. Kelly Loeffler, 14, six said no. And just by way of comparison, most of those who were actually indicted, again, including the former president, 20 of these special grand jurors said yes. What does this tell us? I think let's just start with sort of the politics of what happened. Yeah. Look, I think that for Lindsey Graham, you're probably going to hear him say that, you know, so what, so some people in the grand jury voted to indict me. I was not indicted. There was a clear disagreement between him and Brad Raffensperger about exactly what happened here. Brad Raffensperger, the Georgia secretary of state, of course, alleged that Lindsey Graham intimidated him, pressured him to get rid of legally valid ballots. In the aftermath of 2020, Lindsey Graham said the opposite. He said that I was just calling about the Senate races in 2021. Those determined the Senate majority. He wanted to know if the mail-in voting system was valid. That's what he was concerned about. So there was a complete difference in interpretation of that phone call. Mano, I want to, you talked to Lindsey Graham about this shortly after it became public and I want our viewers to hear what he told you. I think I've ever, right in the world, reached out and said, how does it work? And that's what I did. It's really, I thought a pretty good conversation. I mean, he thinks it was an implicit threat by the way you said. I categorically reject that. That wasn't my intent and that wasn't the purpose of the conversation. You know, throw out ballots. We're talking about an election we haven't even had yet, which is the Senate races. You have conflicting accounts here from Raffensperger and Lindsey Graham. And so you have a he said, he said situation. And some of the jurors thought, yeah, okay, I believe Lindsey Graham and some believe Raffensperger. But if I'm Fonny Willis and I'm looking at that, I'm thinking, well, how do I prosecute that? What do I do? And would I be able to win in court on this one? And my guess is she said, no, I couldn't. And so when you have these kind of accounts and no other information to kind of back it up. There's also this issue too, and this was an issue for all of the members of Congress who were sort of who involved themselves in some way in Trump's effort to discredit or undercut the results of the election of were they acting in their capacity as a member of Congress under the Constitution? Right. He was the chairman of the Judiciary Committee at the time. So his argument has been that this was fully within his rights. He was acting in his capacity as a member of Congress. And whether or not the dispute of actually what happened, what was said in the call was going to be hard for a jury to decide. I think that element also is it's an element of uncertainty for Willis. I mean, she was not going to know whether that would be a persuasive argument because it certainly is an argument that he and a lot of other members have made. I also think, you said the politics of this. The politics for Fannie Willis of this is really interesting to me because this, I think, is going to provide her this information of those she did not charge some political cover from the attacks that she's been receiving for an all out political prosecutor who's just here. She shows some restraint. She obviously did not take all the recommendations of the special grand jury. Obviously, she also, I think from a prosecutorial point of view, chose the ones that she thinks she was going to have the easiest time making the case in court. But it shows this was not some grand sweeping, if you're remotely involved, I'm coming after you. I think it gives her a little bit of political cover. Yeah. And the David Perdue case is also fascinating too as well. He was a pretty mainstream Republican senator when he ran, when he was serving. He lined himself with Trump during the Trump years, no question about it. But then he lost that election and then he ran for governor and pushed those claims of fraud and said the election was stolen. And then he got trounced in Georgia in that Republican primary there, showed you where the electorate is, which was much different than the place that Donald Trump was, and the primary elected about those false claims of fraud in the election. She had to make some choices. And by the way, she did indict 19 people, so let's not forget about that. And you have to make some choices about whether indicting an attorney, Cleta Mitchell is worth it, when you have bigger fish to fry and you have a bigger case. There's another name in here, which is not a bold-faced Washington political name, but it's still interesting. His name is Bert Jones. And he was somebody who the special grand jury saw as somebody who could potentially be indicted. They recommended that he's indicted. Who is Bert Jones? Well, he's now the lieutenant governor. But back then, he was the opponent of a Democrat who Fonny Willis held a fundraiser for. And so if you're talking about trying to avoid political quicksand, this to me is like exhibit, maybe it's not A, because Lindsey Graham is probably A, but this is like A1A. Yeah. I mean, listen, we know there are all kinds of decisions that go into whether to prosecute or not prosecute, obviously the law most important among them and how you can prove a case. But Fonny Willis is a political figure. She's an elected DA. She is a politician. And so there's no doubt that political calculation goes into this thinking as well. Let's look at some of, obviously we don't, and we should make this clear. We do not have visibility into the grand jury transcripts. We don't know the substance of what they heard during all of the testimony that they got, including from people like Lindsey Graham, who went kicking and screaming. He opposed it, but he eventually had to go testify. But we do have some public statements from some of the public figures, like the former Georgia senators, Perdue and Loeffler. And this was at a rally at the beginning of January 2021. I'm encouraging my colleagues to object. This is something that the American people demand right now. There are huge irregularities in Georgia. They need to be investigated and they need to be corrected, in my opinion. My number one objective right now has to be winning on January 5th so that we can get to the bottom of what happened in these elections, what we're fighting here for. And I'm continuing to fight for this president. OK, not a rally, Fox News. The substance was what we wanted to get to. I mean, Loeffler was a fascinating case study in what happened in January 6th. She was going to come back and then object to the Georgia electoral results. But then after all the violence and the mob destruction of the Capitol, she pulled back and changed her approach there. But a lot of this perhaps has to do with both her and Perdue's efforts to try to get Kemp, Brian Kemp, to have a special session to essentially overturn the election. Kemp resisted that. But perhaps that's one big part of that was being investigated here. And meanwhile, in the here and the now, you have on Capitol Hill, Jim Jordan, the Oversight Chairman, investigating, or at least trying to investigate, the Georgia investigation led by Fonny Willis. And she wrote a letter, a very, very scathing one. You think? One might call it a mic drop letter saying, back off, Mr. Jordan. I'll just read part of one section. For a more thorough understanding of Georgia's RICO statute, its application, and similar laws in other states, I encourage you to read RICO state by state as a non-member of the bar. Just going to let that hang there for a second. You can purchase a copy for $249. It was like she was saying, I'm going to send you, or you can buy RICO for dummies. And this is what you need to do. I mean, this is where you know that she's a politician. Just sending a letter like that to another politician is something another politician would do, not a layperson, I'm sorry. No one would do that. It works for both sides, right? This works for Jim Jordan and for Fonny Willis. This is a fight both welcome. We have some breaking news that I want to discuss here, and that is Nancy Pelosi, the Speaker Emerita, who is still a member of Congress, announced in California that she is going to run for yet another term to be a rank-and-file member of the House. Manu, you have been covering her for a very long time. Does this surprise you? A little bit, yes and no. I mean, not surprised because she loves the fight. She loves to be in the middle of it. I think she's settled into a role as a rank-and-file member of the House after being the leader and speaker of the House for two decades. She's been in office since 1987. She's 83 years old. So there is probably some expectation that perhaps it's time for her to move on. There's already been a succession to quiet moving behind the scenes to replace her, including potentially by her own daughter. But you know, this... Pelosi is enjoying, I think, this moment and believes that Democrats could get back in the majority next cycle. And she's making clear she's not going anywhere for at least for the next 20 years. It has been really interesting to see that the transformation for her, it's like a weight has kind of lifted off of her because she doesn't have to do the rallying and the jockeying that she... And the babysitting.... that she is still so good at and kind of figuring out everything that she needs to do to keep her very vast caucus together. And she can just kind of do what she wants and have a good time at being the representative from San Francisco. You've covered her for a long time as well, Julie. I think there was an expectation, and I would include myself in this theory, that she was not going to want to be in Congress when she couldn't be in charge because that's just kind of the person she is. Like Manu said, she loves to be in the middle of the fight. She loves to be leading the fight. And there was a real question in a lot of people's minds, and I think maybe in her mind as well, whether she was going to enjoy serving when she wasn't the boss of everything. But I think you're right. I think she has really settled into this role and feels like it's worthwhile to stay. She does, I think, see a potential that Democrats could take the majority again. And then that would be even more fun for her to actually be in the majority but not have to be in the center of every single fight, grinding it out every single night the way she did. And she has a big role in raising the funds to become the majority party. And so there's nothing rank and file about Nancy Pelosi. Let's be clear. OK, fair. OK, fair. So yes, she is not in a position of leadership anymore. Not only is she loving this moment in time in her life in Congress and able to get all these accolades and sort of awards and achievements for her long career, but she's still, yes, in the process of handing over a fundraising network to Hakeem Jeffries, but still very much the person that can raise the most dollars for Democrats. And they are so close to the majority that that's a key part of this, too. You know, I think it's also gender related. She wants to see women in Congress, and she defends Dianne Feinstein and says she should stay no matter what her problems are. And so, you know, I think that's also in her head. And let me be clear, she's in her early 80s. I still can't keep up with her in heels. Oh, and she's wearing heels. I'm not. I know. I know you're the same. I'm not. I'm not wearing heels. I still can't keep up. Not on Fridays. All right. Up next, lawyers weigh in on the special grand jury report and why Fonny Willis might have decided against indicting even more people in Georgia. Hi I'm David Axelrod, CNN's senior political commentator, former senior advisor to President Obama, and host of the Axe Files podcast. Join me each week as I interview key figures shaping our world from politics to the arts to sports and beyond. Listen on your favorite podcast app or ask your smart speaker to play The Axe Files with David Axelrod. Your favorite 98 couples are back and they're in therapy on 90 Day, The Last Resort. We are here because we've had a lot of issues with infidelity. On 90 Day, The Last Resort sessions, the official podcast, we break down what happened in couples therapy on that week's episode. I'm not taking it. I took it a whole year with my husband lying, cheating. And offer insights into how to make your own relationship thrive. As a therapist, I do not believe the hall pass is a good idea at all. Listen to 90 Day, The Last Resort, wherever you get your podcasts. We're now on that Fulton County grand jury report. It recommended indicting 39 people, including Senator Lindsey Graham and former senators David Perdue and Kelly Loeffler, both of Georgia, of course, Graham of South Carolina. It is important to note, of course, that the district attorney, Fonny Willis, chose not to indict those three and several others. Here to try to explain and read those legal tea leaves, CNN's Paula Reed, former federal prosecutor Elliott Williams and Emory Law Professor Kay Levine. Thank you so much, one and all. I will start with you, Professor Levine, down in Georgia, where this is all taking place. What do you make of the fact that this special grand jury recommended 39 indictments and that Fonny Willis said for 20 of them, no thanks? Well, I think there's really two things that viewers should pay attention to. One is that prosecutors always have the choice. They first ask, you know, do I have all the legal requirements been met? And then they ask, should I go forward with a prosecution? You know, the first question is, can I? And the second one is, should I? So there's nothing really unusual about a prosecutor's office looking at the range of evidence and deciding even if we think the evidence is there, it might not be worth, given the balance of interest, it might not be worth pursuing a prosecution against this person or for this crime. The second thing viewers should keep in mind is that all of these crimes that have been charged all have intent requirements that are pretty specific. And I suspect that for Lindsey Graham and David Perdue and Kelly Loeffler and some of the others, the office may have been concerned about not being able to prove criminal intent that's required in the range of statutes that they were considering. Very interesting. And you were listening to the professor nodding your head, Elliot. Absolutely. There's a few things going on. Number one, establishing intent would have been an issue for the senators because you might have run into a concern with, as members of Congress, they're protected by what's called the speech or debate clause of the Constitution that might have gotten in the way of charging them with a crime. Also a possible legislative interest that members of Congress have, even setting aside the sort of partisan mischigas of all this. There's still- Is that a legal term? It is a legal term. I saw your face brighten there. That was for you, Dana. But because of that partisan business, they still do have some purpose, some function to oversee federal elections. So there might have been an issue there. And you saw, at least in the vote breakdown, which we should not make too much of because how they voted doesn't really matter to prosecutors, but it was still a harder issue they grappled with. You don't think so because you don't think it's perhaps- because we do not have visibility into what the special grand jury heard. We haven't seen the testimony. You don't think it says anything about whether they were persuaded one way or another with the evidence? Yeah, because if you're having trouble convincing all of these people in a special grand jury, doesn't that send up a red flag that when you walk into a different forum, a courtroom where you have a standard beyond a reasonable doubt, you have defense presentations, you have lawyers with witnesses in the courtroom, doesn't that send up a red flag for you? Like maybe, okay, let's put this in the maybe pile and take a second look. What I would say is that legal issues are hard. Our jurors sometimes get them wrong, sometimes get them right, and it would have been up to the prosecutors to independently investigate and research all of this all of their own. Even if the jurors had- if it were 10-9 or 10-8, maybe prosecutors still could have charged them because there was a complicated legal issue. We do have just in the case of Lindsey Graham, professor, the allegation was that he tried to meddle in the Georgia- in the federal election in the state of Georgia by making a phone call to the Georgia secretary of state, Brad Raffensperger. He, Lindsey Graham, has denied that, that that's not what he was trying to do. He was just as a member of Congress trying to get information. The secretary of state has said in public, especially to CNN, Wolf Blitzer interviewed him that he had a different impression of what Senator Graham was saying. Let's listen to that. You described to the Washington Post a conversation you had with Republican Senator Lindsey Graham on Friday. You came away with the impression that he essentially wanted you to look for ways to toss out mail-in ballots. What exactly did he say to you? Well, he asked if the ballots could be matched back to the voters, and then I got the sense it implied that then you could throw those out. And he really would look at the counties with the highest frequent error of signatures. So that's the impression that I got. Presumably that's the testimony that he gave in private to the special grand jury as well. Professor. Yeah, I think here we get back to the issue of intent, right? If Senator Graham says, well, when I was speaking that way, it was not my intent to do X, it was not my intent to do Y, then I think the prosecutor's office has a real concern about how that kind of discrepancy would play before an actual jury. I think we also see, there's one thing to point out, there's a footnote in this grand jury report that specifically discusses Perdue and Loeffler, which I found very, very interesting. It says the jury believes that their statements following the November 2020 election while pandering to their political base do not actually give rise to criminal liability. So I think probably that is giving some signal also to Fannie Willis and her team that there will be different ways to construe some of these public statements that were made. I think that's exactly right, that footnote. And that's the tension you run into prosecuting any elected official for things that are tied to the work of their office or free speech. The problem here is these people, and we should note this, they were not charged with crimes and their names were announced in this document. Certainly Georgia law allowed it, but we in the criminal justice system do process rights of people. And it's a big deal that these names came out, and I don't know if it was necessarily a great idea. I think that's an important discussion that's going to go on now. As journalists, of course, we err on the side of transparency. We want to know. This is a historic document. It gives us insights into this, again, unprecedented investigation. But so far in the state of Georgia, they've erred way, way on the far side of pro-transparency. Cameras in courtrooms, right? We'll all agree that's great. Maybe not so great naming the grand jurors, listing their names and releasing those names to the world. Those people have been doxed. They have faced threats. We see the district attorney walking that back for a potential jury. And then here, I think this is going to be the subject of some debate. These people now don't have a process to clear their names. We're talking about how it was recommended that they be charged, but they weren't. Again, we err on the side of transparency, but I think it's a very legitimate question whether these kinds of grand jury proceedings should be public. Even if they're politically unpopular individuals, set that aside, they are still people who are not charged with crimes who's ninja now public. Really important point that you made there. All of you, thank you so much for that discussion. And up next, dismal poll numbers, the threat of a massive union strike and the sun on the brink, a sun on the brink of indictment. President Biden leaves the country, but can't escape some troubles he's having right here at home. President Biden is in India for the annual G20 conference. The war in Ukraine and climate change are two of the agenda items there. Meanwhile, here at home concerning new poll numbers, a looming auto worker strike and the expected indictment of his son Hunter are serious troubles that he most surely cannot leave behind. CNN White House correspondent Jeremy Diamond joins us live from New Delhi, India. Jeremy, what are you hearing from sources inside the Biden team about how he is trying to kind of square where he is with what he left behind? Well, listen, Dana, there's no question that any world leader wants to come into one of these summits from a position of strength, both at home and abroad. And there's no question that President Biden is arriving at this summit from a position where his his poll numbers are not where he would like to be. And in a very different position from where when he came to the G20 last year after those midterm elections that saw Democrats really outperform historical trends. So this is a very different moment from the president, but at the same time, you know, the president's advisors tell me that what they see here is also an opportunity, an opportunity for the president to use basically the best car that you have as a political candidate, which is being the commander in chief on the world stage. And there are certainly opportunities for President Biden at this summit to put the United States in a position of leadership, especially and that is really the mission here as it relates to the developing world. Is President Biden looking to try and show the developing world that the U.S. is a reliable partner? And he's also going to continue to press on issues, despite the fact that even the host country India really isn't on board with a lot of these sanctions campaigns as it relates to Ukraine, hasn't really condemned Russia's invasion of Ukraine. I'm told that President Biden will nonetheless make a very forceful stand, making clear where the U.S. stands on Russia's invasion of Ukraine. And those differences are really going to still be apparent here. Even as President Biden makes that stand, it's going to be very difficult, given the fact that Russia and China are both members of this G-20, to get a joint communique that iterates a unanimous position in particular on that war, which is also why we're going to see the president pushing here on other fronts, including on the developing world and taking advantage of the fact that China's President Xi Jinping is not here. We just had a briefing from a senior administration official who made clear that India is upset about the fact that China is not here and the U.S. certainly sees an opening on this stage. Dana? And of course, Vladimir Putin is not there as well. Thank you so much for that. I appreciate that reporting, Jeremy. And our reporters are back here now. What Jeremy was just saying about kind of the word from Biden world about how to view this trip, I was also told by a senior Biden official, particularly on the questions of age and whether he's got it still, the whole watch me, which Joe Biden says over and over again. Well, he's going to go to India and back in fewer than five days, and he's traveled even more abroad than Donald Trump. So what's the problem? The problem is his age. And they can't get away from it, as we saw in our poll. Something revolves around the fact that that younger people don't find him inspiring and they wonder about his fortitude. And I think that that is something that they have to deal with straight on. They're trying to in ads. They just put out an ad that showed his trip to Ukraine, which was very strenuous. And that's they're just going to keep plugging away because this is one thing you cannot change, which is how old he is. You just can't get around that. In fact, he'll get increasingly older. Are you sure? And you have two sources on that. And as they say, age comes with wisdom. Well, that I mean, that is the double edged sword, though, right? That there is Jeremy was saying they see the age and experience in a lot of ways as a ritual. They want voters to see it that way, certainly. And this is an opportunity, a trip like this for him to showcase that. I mean, this is his sort of sweet spot. This is kind of his area of expertise for a long time, global affairs. And he will have the chance to speak publicly about it and be sort of like the leader of the free world rallying everyone around a cause, although the politics of that as well, geopolitically, are difficult, as Jeremy was also saying. But it also goes back to what Gloria was mentioning about that people don't find him inspiring. It's like we know that already about Joe Biden. He is the stable, strong leader that that's sort of baked in. And I think the big frustration right now for his campaign, for his allies, is that they can't seem to break out of that. And I think that's some of what's reflected in the polling. Yeah, I think it was interesting, this initial ad here, by and put up by the Biden campaign. Typically, foreign policy issues are not the front and center. It's economic issues. And when I talk to a number of Democrats in the aftermath of our polling, their concern is that the economic agenda that they believe that Biden deserves credit for, he's not getting enough credit for. They, the Biden team, clearly sees that this, about his efforts to bring the world together in the fight to save Ukraine is such a central part of his narrative as president. And they believe that will sell, will play well with voters. The question is, how do they reconcile those economic concerns? And David, there was an op-ed by Charles Blow in your paper. And I'll just show the headline. Dignified silence doesn't work against Trump. To me, politically, this is the crux of the question and the challenge for Biden world, because he's selling himself as he did going into the 2020 election as somebody different, who somebody is not Trump, who somebody who you can trust, somebody who's a grownup, all of those things. And yet to fight politically against him in these times, do you have to fight his fight on the Trump level or at least closer to Trump's level than the Biden campaign and Biden himself are willing to go? You certainly have to engage in a fight. I don't think you have to fight Donald Trump's fight. You have to fight Joe Biden's fight. And the president is fond of saying, don't compare me, the almighty, compare me to the alternative. They need to sort of figure out how they're going to move into that contrast campaign on a daily basis now. Because as you said, sometimes the president wants to restrain himself, doesn't want to comment on the legal matters that former President Trump is involved with right now in his indictments. He doesn't want to in any way jeopardize those cases. And yet that is the information stream that is out there about his potential opponent right now. And so at a certain point, if Joe Biden is going to commit himself to making this a battle for the alternative, you got to start presenting that to the American people. So fascinating. OK, up next, did Fannie Willis do the right thing by not bringing charges against a sitting United States senator? I will ask a member of the former January 6th committee after a quick break. This week on The Assignment with me, Audie Cornish. Throughout the life of this podcast, we've asked you, our wonderful listeners, to pick up the phone and leave us assignments. And you know what? You delivered. Curiousness to the ongoing coin shortage. And what's the deal with that? Here's what we did. We took three of your assignments and then called up three reporters who could give us some answers. Listen to The Assignment with me, Audie Cornish, on Apple Podcasts, Spotify, iHeartRadio or your favorite podcast app. More on our top story. The Fulton County grand jury report revealed it recommended indicting thirty nine people, including Senator Lindsey Graham and former senators David Perdue and Kelly Loeffler. Why didn't the DA follow through? Well, let's discuss that and more with Democratic congressman and ranking member of the House Oversight Committee, Jamie Raskin, who, of course, was also a member of the January 6th committee. A lot of titles that you have there, sir. I want to just first get your response from this report out of the Fulton County special grand jury. The idea that the particularly these three senators, two former, one current, were recommended for indictment, but Bonnie Willis ultimately decided never mind. Do you think that was appropriate? Well, I think everybody did their job here. I mean, we can't enter into all of the tactical and legal and prudential considerations that Fannie Wilson took into account when she made her decisions about who precisely to prosecute and who not. At the very least, the release of this document from the special grand jury decisively refutes the claim that that Ms. Wilson is on some kind of indiscriminate partisan dragnet against all Republicans and anybody who had anything to do with Donald Trump's efforts to overturn the results of the 2020 presidential election. She made some very fine grained strategic and calculated prosecutorial decisions using her discretion in that office. And so I think it does debunk the campaign against her. So you think that this is proof that she is not being as overtly political as Republicans claim she is. Do you think it's only that or in part it's frankly just thorny to prosecute a sitting U.S. senator, never mind former senators who argued that they were doing their job, they used the speech and debate clause to try to thwart a subpoena in the first place? Well, I looked through that special grand jury document and it seemed that in some of the cases of the elected officials, the votes of the grand jurors were more closely divided than they were in the cases of some others, including Donald Trump, where it appeared to be unanimous to find that there was probable cause to believe that they had committed crimes. That may have entered into the calculus for Fannie Wilson. But again, it's inscrutable. We can't really know exactly what went into it. And to me, it gives me confidence that we've got prosecutors here that are making very fine-grained, selective judgments. I mean, just like the decision in the government documents case, they didn't charge Donald Trump with pilfering and maintaining all of these documents, only the ones that he held back even after he was given a chance to return them. And so I think in each of these cases, we're seeing proper reasonable exercise of prosecutorial discretion. I want to ask about something different that you have been involved in, and that is a former advisor to Donald Trump, Peter Navarro. He was convicted yesterday of contempt of Congress for refusing to comply with a subpoena from the January 6th committee that you sat on. You actually were the one who announced those contempt citations. I would imagine that you feel satisfied that he was actually convicted. And do you think that, just generally speaking, how strict should the sentence be? Yeah. I mean, this is another example where we see the rule of law actually working. Navarro blew off the January 6th committee's subpoena for him to come and talk to us. He did not render one minute of testimony, and he did not give us any of the documents he was subpoenaed for. So I think it took the jury all of three or four hours to determine that this was an open and shut case. He just violated a subpoena of the United States Congress. Would you like to see him in jail? Two of them, really, one for documents. Well, you know, somebody in a similar situation is Mr. Bannon. Now, Steve Bannon also just stayed on the couch and blew off the subpoena of the House. He's been sentenced, I think, to 30 or 45 days in jail and also given a financial fine. It's on appeal. He hasn't served any time in jail yet. I mean, somebody in a different position was Mark Meadows. We recommended that there be a prosecution against him for contempt of Congress in the same way with the others. But the Department of Justice decided not to bring that case because he had engaged in some partial compliance with us. So again, I think we see the rule of law working, and it's not really a subjective call on who I'd like to see punished in what way, but rather that the system itself continues to work. Congressman Jamie Raskin, thank you so much for coming on with this breaking news, particularly out of Fulton County. Thank you so much. You bet. And an extreme White House makeover, the most secure facility on the planet gets a glow up. Just how much did it cost and what does it look like? Well, we might not be able to show you that, but we'll tell you details next. The White House Situation Room just got a $50 million makeover. The high security complex under the Oval Office is where presidents receive top secret intelligence. And it's been glorified in countless movies, including one of my favorites, Air Force One from Columbia Pictures. You lost a tanker? What else? They're counting 32 survivors. That means they still have hostages. What about the first family? No word yet. Losing hostages will make the terrorists even more desperate. Madam Vice President, get Air Force One on the line. This is Vice President Bennett. We're listening. I now hold hostage the President of the United States of America. Her chief of staff is just so cute. CNN Senior White House correspondent Kayla Tosche is Tosche. Forgive me, joins me now. Kayla, this is so interesting. What have you learned about why the makeover over and what it looks like? Well, the White House said that the complex, which is actually five rooms, had suffered heavy wear and tear over the years because it staffed 24-7 their briefings multiple times a week and that the technology needed a significant upgrade for the first time in nearly two decades as well. Today, the White House brought a few reporters in for some rare access to the facility. These are photos. These are photos of the new newly refurbished Situation Room Complex, which they call the WIZR, W-H-S-R. They don't call it Sit Room or the Situation Room. It's WIZR to the initiated. But they demoed it down to the studs. They dug out five feet below the ground, dug out cables. And what you see now are LED screens, high-res monitors, mahogany paneling, some pretty intricate stonework and seals that can be swapped out depending on who's leading the meetings at the head of the table. We're used to seeing the old pictures of the old Situation Room with the yellowing walls, the old wood, the saloon style doors. And of course, most famously when they were capturing, killing Bin Laden, you see that there. Yes. And some of the portions during the renovation were saved for posterity. This particular room that you're looking at was reconstructed, was saved, removed, and it will be reconstructed in Obama's presidential library. It's now two phone cubbies. And so that room is no longer. WIZR? WIZR. OK, we have to tell Wolf that because they might have to change the name of their show. He is the real Situation Room, let's be clear. He is. Thank you for that reporting. Thank you so much for joining Inside Politics. CNN News Central starts after this."}, "podcast_summary": "The podcast discussed the Fulton County Special Grand Jury Report, which recommended indicting 39 people, including key political figures associated with Donald Trump. However, District Attorney Fawni Willis decided not to prosecute some of these individuals, including Lindsey Graham, David Perdue, and Kelly Loeffler. It was noted that the grand jury felt that many people deserved to be indicted, but prosecutors went through each name to determine the strength of the case. In the end, 19 individuals were indicted, including former President Donald Trump, while others were not. The decision not to prosecute certain individuals may have been based on factors such as the ability to prove a case in court and the presence of criminal intent. The podcast also discussed President Biden's trip to India for the G20 conference and the challenges he is facing at home, such as declining poll numbers, a potential auto worker strike, and the expected indictment of his son Hunter. It was mentioned that the trip provides an opportunity for President Biden to showcase his leadership on the world stage, particularly in areas like climate change. However, concerns were raised about his age and the perception that he lacks inspiration. The podcast also touched on the conviction of former Trump advisor Peter Navarro for contempt of Congress and the ongoing investigations into the events of January 6th. Representative Jamie Raskin expressed satisfaction with Navarro's conviction, emphasizing the importance of upholding the rule of law. The podcast concluded with a discussion of the renovation of the White House Situation Room, referred to as the WIZR, which included the installation of new technology and design updates. Some original features, such as the room used during the raid on Osama bin Laden, were preserved and will be displayed in the Obama Presidential Library.", "podcast_guest": {"name": "Fonny Willis", "org": "Fulton County District Attorney", "title": "", "summary": "Not Avialable"}, "podcast_highlights": "- Highlight 1 of the podcast: The district attorney decided not to prosecute key political figures despite a go-ahead from the special grand jury.\n- Highlight 2 of the podcast: The special grand jury recommended indicting 39 people, including Lindsey Graham, David Perdue, and Kelly Loeffler.\n- Highlight 3 of the podcast: The special grand jury felt that many people deserved to be indicted after hearing months of evidence.\n- Highlight 4 of the podcast: The district attorney ultimately indicted 19 individuals, including Donald Trump, based on the recommendations of the special grand jury.\n- Highlight 5 of the podcast: The decision of who to indict and who not to indict was based on a careful review of the evidence and what could be proven in court."}