{"podcast_details": {"podcast_title": "Politics Weekly UK", "episode_title": "Raac, Rishi Sunak and a reshuffle at Labour – Politics Weekly UK podcast", "episode_image": "https://uploads.guim.co.uk/2022/02/18/PoliticsWeekly_UK3000.jpg", "episode_transcript": " This is The Guardian. $15 a month. Give it a try at MintMobile.com slash switch. New activation and upfront payment for three-month plan required. Taxes and fees extra. Additional restrictions apply. See MintMobile.com for full terms. Introducing Carvana Value Tracker, where you can track your car's value over time and learn what's driving it. It might make you excited. Whoa, didn't know my car was valued this high. It might make you nervous. Uh-oh, market's flooded. My car's value just dipped 2.3%. It might make you optimistic. Our low mileage is paying off. Our value's up. And it might make you realistic. Car prices haven't gone up in a couple weeks. Maybe it's time to sell. But it will definitely make you an expert on your car's value. Carvana Value Tracker. Visit Carvana.com to start tracking your car's value today. This week, kids go back to school. Or rather, some of them do, because of what might turn out to be the defining story of Rishi Sunak's time in office. Children being sat in classrooms under metal props to prevent the ceilings literally falling in on their heads. It is scandalous. And then there's the small matter of the government's response. Does anyone ever say, you know what, you've done a f***ing good job because everyone else has sat on their a** and done nothing? No signs of that, no? After 13 years of Conservative rule, is this finally the undeniable beginning of the end? I'm John Harris and you're listening to Politics Weekly UK for The Guardian. Joining me today is The Guardian columnist and feature writer Gabby Hintzliff. Hello, Gabby. Hello, John. Now, it's Wednesday afternoon when we're recording this and Gillian Keegan, the Education Secretary, who we'll be talking about quite a bit in this episode, is still in her job. But let's remind ourselves of the huge story that suddenly burst into the political foreground over the last week. With only days to go until the new term started for kids around the country, England specifically, the Department for Education announced that more than 100 English state schools would not be able to fully open due to the presence in their buildings of RAAC, otherwise known as RAC, or Reinforced Auto-Claved Aerated Concrete. And everything has gone from there. Gabby, just talk us through quickly because I know you know about this, how on earth we got here. Yeah, so RAAC is a kind of lightweight, cheaper, more convenient kind of concrete that was used in building from the 60s onwards until the 90s. And in the building trade concerns have been raised about it basically from the 90s onwards because it does have this shelf life of only about 30 years, and it was starting to reach its sell-by date and to fail in some buildings. But until recently, it's been treated, I suppose, a bit like asbestos in public buildings, something we knew was bad and it had to come out, but it seemingly didn't happen overnight. It could be replaced gradually over the long term as part of a maintenance program. So schools that had RAAC beams in their buildings that weren't deemed at critical risk were told to monitor it, i.e. if you see a big crack, do something, but otherwise it could wait for the sort of routine maintenance program. So the first real wake-up call was in 2018 when a roof came in on a primary school in Kent, luckily at a weekend when it was empty. And that's when the DfE realized that it needed to step up and needed to be repairing more schools and we'll come back in a minute to what happened when they asked the Treasury for the money to do that. But then last year, the real urgency kicked in with warnings about RAAC starting to fail on the government estate with little or no warning. So even if you were monitoring it, you might not necessarily realize in time that the ceiling was about to collapse or whatever. And what really spooked ministers this summer is said to have been some RAAC collapses out of the blue. And it's at that point that Gillian Keegan basically said, watching and waiting is not safe. These schools have to shut and get fixed now. And that's when everyone started saying, well, how, you know, financially, how did we get to the point where this could happen? So on a practical level, it's a big deal, a problem to be solved. But on a more emotional level, it's become symbolic of the idea of Tory cuts coming home to roost. You don't spend money and you regret it. That's the point, isn't it? So in raising the alarm, the DfE then triggered a whole set of questions, many of which politically center on the last 13 years of Tory government and specifically austerity and cutbacks as far as the maintenance of public buildings are concerned, in this case schools, chiefly, although this also applies, we are told, to hospitals and magistrates, courts and other parts of the public estate. That's it. And it's the sense that, you know, bad choices were made in the past and maybe we didn't see the sort of consequences of that immediately. But eventually, you know, suddenly everything's falling apart. So a stroke of a pen in a treasury department 10 years ago and now your child is sat under a ceiling that's held together with a wooden prop. That is quite a powerful thing. Yes, particularly given that one of the politicians who is chiefly implicated in this mess is George Osborne. And he was fond of saying that his opponents, the Labour Party, did not fix the roof while the sun was shining. Ho, ho, ho. I say that in a spirit of sort of gallows humour. There are, we know, over 100 schools that have had to close either partially or entirely to kids this week due to unsafe rack being found. One of those is Honeywood School in Essex, a county where 50 of the 100 plus affected schools are. Its head teacher is James Saunders and I'm pleased to say he joins us now. Hello, James. Thanks for joining us. Good morning. Tell us, first of all, when and how you found out that you were one of the affected schools. So we were aware that we had rack in the school for some time and that has been monitored as part of our management plan. At that particular point, we had no rack rated critical. So the guidance and the policy at the time was you don't need to do anything immediately. There's no impending risk. Right. And then there was at some point between mid-August and last Thursday a change in that policy and the rating for risk, which meant that anywhere that there was rack, whatever the risk rating, you couldn't use it. The outcome of that is 22 classrooms out of action now at school. So how did you find out that things have changed, that you were going to have to take this drastic action now? Telephone call on Thursday afternoon last week. Wow. OK. And I would imagine that took you completely by surprise. Yes. So I had popped into work to get ready for a regular start to term and was tidying up the office and whatnot. And then I went home in the late in the afternoon and I was just sitting down and then had a phone call. And what does 22 classrooms being out of action just entail in terms of what you've had to tell kids and parents? It's pretty much half the school. It's also 22 other spaces, staff room, staff toilets, children's toilets, our room that we use for counselling vulnerable children, the medical room, the reception for children, offices for heads of year. So there's a lot of other things that happen behind the scenes that are also out. That's 22 other spaces as well. Wow. So given the scale of that disruption, how are you coping? What are you doing with the kids? Can you get all of them back? Have you got some of them at home? Are you looking at alternative accommodation? Yeah, all of those things are kind of go through one at a time. So, no, if we don't do anything else, we can't operate the school fully. We cannot have all the children back at most. And it's quite a squeeze, but we've been able to rewrite the timetable to have three year groups in at a time. We've got five year groups in total. So that means that they have to work remotely on some form of rotor. So you'll have a bit of time in school, a bit of time out school, and that will vary across the years. But that's not a long term solution. None of us really want to do that. So the aim is to get everyone at school. The only way we can do that is if we provide additional school classrooms to teach them on site. Well, luckily, we got a pretty big school field. So we've got a space that we can put temporary structures. The next step is to source and secure those temporary structures. It's all pretty unsettling for the kids, I imagine. In the meantime, how are they responding to yet more upheaval? Because it's been three years of this, hasn't it? In and out of lockdown, bubbles, rules changing, things moving around, lots of disruption. Well, we know from our experience of the pandemic, we see it in our current year 10s, the impact that lockdowns and transition had of lockdowns from not finishing year six and their SATs and their primary school ended under lockdown. We've seen the knock on effect that had on their transition from primary to secondary school. And you see that in the current year 10s quite a lot. What do you see in those year 10s? What is that? You just see increasing mental health issues and anxiety. You can have social issues and things that were born out of a lack of the kind of day to day human contact. Having been through once the experience of remote learning and kids not being in school, having to do it to some extent again, tell me what thoughts you have in your mind about how that will affect the kids. My personal thoughts initially were almost a Groundhog Day feeling, a kind of COVID PTSD response, really, because it was quite tricky, but there was a whole lot of things attached to that. I've done remote teaching as well, and actually I think it's a lot tougher than just teaching them face to face, and it's a lot harder to connect. But you must also have had some kids, and you may have some kids again, who almost cease to learn at all because they just haven't got the set up at home or the circumstances that allow them to learn in that way. Yeah, exactly. And where it's slightly different now to the pandemic, where you could have maybe children in that situation, you could accommodate a more hybrid model and have them in school. When you've got a school with half of the buildings out of action, you haven't got the space to do that. Do you know how long you're going to be operating like this? Have you had any idea, any sense of how long the building work is going to take? Yes, I have. So the way to get the rooms back in functional order is you need to put some form of prop that goes up on the ceilings. That process takes two to three weeks. That's commencing on Monday. So if we look at it the most optimistically, it would take another two weeks. But then I've got to get that work done. And that's going to take at least 25 weeks to complete that work. That duration of time is pretty much two lockdowns. So it's unacceptable in my eyes. I'm almost refusing to do that. I need to do something else. And so therefore, then the next step is to, OK, look at what can we do to get something on site to replace our 22 classrooms. Even that must be very difficult to accept. I'm very much a practical person. I just want to get on, solve the problem and do it. And I don't see barriers where there are barriers. It just looks like it's a simple solution to me. As simple as picking up a phone and saying, how many have you got? OK, how much is it? But actually, in my contacting of Porter Cabin organizations, a lot of them had already been spoken to by the DFE and kind of a part of their, I guess, procured set of Porter Cabin suppliers. So they wouldn't really deal with me because their mandate was, OK, you've got to collect any information and then we need to prioritize. So it's almost triaged by the DFE. But stop there. That suggests that because of the gravity and sudden speed of this crisis, it's not quite clear who's responsible for what, right? It could well suggest that, yeah. I was being sort of understated, yeah. I mean, the DFE says it told schools as soon as it could of what it had learned about RAC. Do you buy that? Do you think they could have let you know earlier? It was a totally different scenario if they told you this at the beginning of July and you'd had some holidays to work it out. Yeah, I do buy that, to be perfectly honest, because I know that as late as around mid-August, even the DFE were following the previous policy because we still had an email about the stuff that I told you about at the start. But we know that something's happened in buildings that weren't critically rated, OK, which has then forced a change in rating the risk. You say that, but choices being made that mean less money being spent on the maintenance of school buildings, that is someone's fault. Well, yes, indeed. Yeah, yeah. I mean, that's a separate issue. I've been at the school for about five and a half years now. And since I arrived at the school, I have been trying to push for a new school building. I wonder, I mean, roughly, what proportion of your kids do you worry about in a situation like this? Becoming disconnected, coming nowhere near the level of learning that they ought to be doing, perhaps falling away altogether? Well, the first group are children with EHCPs. Education, health and care plans, right? Yeah. These are special needs children who have mainly predominantly autism. So our school has an autism hub and we have the highest number of EHCPs in Essex, pretty much. Autistic children will struggle with change to routine. That's exactly what crisis like this do to them. So you've got that group as well as then looked after children, pupil premium children. The list goes on. All children really have something that will cause some difficulty for them because you could have children that have no one at home to be able to support them. The list goes on really. Yeah, one final question. And we've talked a lot for obvious reasons about the effect on the kids of being in this situation. But if this building and buildings like it that have rack have been dangerous for a while in ways that we perhaps didn't understand at the time, it's not just kids who've been potentially exposed to risk. It's you and your teaching staff as well. You've been working day in, day out in a building that wasn't possibly safe. How does that make you feel that government left you in that position? It makes me feel bad that I've done that to my staff, to be perfectly honest. I can take risks myself, can't I? So I'm responsible for myself. So I'm not really worried about myself, but I am worried about the staff that I have that we could have been a step away from an accident happening to them or our children. And that's unforgivable, really. Yeah. Great. Thank you so much, James. Really appreciate it. Yeah, you're welcome. Really, really great. Thank you. OK, let's talk about the government. Gillian Keegan, the Education Secretary, has inevitably been the woman at the centre of all this. As anyone with a passing interest in politics probably knows, she was caught off mic on Monday, apparently telling us how she really felt. But we will get a plan and every single one of them will be done. OK, thank you very much. Thank you. Does anyone ever say, you know what, you've done a good job because everyone else has sat on their ass and done nothing? No, no, no signs of that, no. Gabby, in the midst of this story, and it's not really that important, but it's attracted a lot of comment, the government's communications technique or approach has been pretty awful, hasn't it? I mean, as well as Gillian Keegan being caught off mic there, there was a sort of chain of, I don't know what you call them, the sort of pictorial memes that are put on social media by the government with a view to people retweeting them, passing them around and so on. And one of those said, most schools unaffected, which the Labour Party then responded to with a sort of thing that alluded to Jaws effectively saying, look, most people don't get eaten by sharks, so it's all right to go in the water. That was terrible, wasn't it? Yeah, I mean, that was really indicative of a government, of a department doing something on the hoop for not really thinking about it. Because actually, to be fair, there's an important point there. If you were a parent listening to this thinking, oh God, you know, schools aren't safe, maybe I should never let my child out of my sight again, you know, of the whatever it is, 23,000 odd schools in England, we are talking about 150 that have had to close. And in the other schools, it is really important for kids to be back in school, not just to learn, but be with their friends for their happiness and their mental health. So ministers do need to send the message that it's business as usual for most parents, but without making it sound like we should all be grateful that there aren't many dead, you know, it's kind of, it's that and that's the trouble as well with with Gillian Keegan's, you know, hot mic moment is that it was never meant for public consumption. And now it's out there, you can see why it sounds awful. And I think that's the point she's asking, she's saying, why is nobody grateful for my brilliant stewardship? But actually, to tell you I feel sorry for her, you know, when she said at the time, she didn't say at the time who she meant had been sat on their ass while she was sorting things out. Subsequently, she said she meant schools who didn't didn't respond to DFE questionnaires. But I do wonder if that's who she originally had in mind given when she was appointed, she was the sixth education secretary in a year, after months of the kind of absolute chaos that makes you wonder how anything kind of got done at all. And DFE does seem to be ahead of some other departments in dealing with RACs, we know it's elsewhere in the public realm as well, to the point that some people in government seem to be briefing against her now suggesting that she's overreacted, she's, you know, gone too, she's been too hasty and she made everyone else look bad. So I do understand why she might feel frustrated, although I bet she's feeling even worse now. Let's focus on Rishi Sunak momentarily. When he was asked about all this, his response was somewhat techy. I think that is completely and utterly wrong. Actually, one of the first things I did as chancellor in my first spending review in 2020 was to announce a new 10 year school rebuilding programme for 500 schools. Now that equates to about 50 schools a year that will be refurbished or rebuilt. And if you look at what we've been doing over the previous decade, that's completely in line with what we've always done. Can you just explain the maths in that response? Rishi Sunak said that he announced a new 10 year school rebuilding programme for 500 schools in 2020, which equates to 50 schools a year, as if that was a plus point. There are certain readings of that which say it's not a plus point at all. Yeah, 50 schools a year, you know, that's only you can only understand that number relative to how many schools actually needed fixing. So back in 2018, you remember we said that a primary school in Kent had its roof falling. That year, according to the then permanent secretary at the DfE Jonathan Slater, who's a bit of a sort of whistleblower on all of this, he said that that year the department decided that it was going to have to step things up and it would have to repair 300 to 400 schools a year. So that's the scale of need. And the treasury, they went to the treasury, asked for the money, and the treasury said you can have the money to do 100 schools a year. Obviously not enough, you know, in the first place. So the DfE went back and asked for more in the 2020-21 spending round. They bid to double the programme, said can we have enough to fix 200 schools a year? It still wouldn't be quite enough, but you know, better than it was. And instead, the treasury by then run by one Rishi Sunak halved it, said you can have the money for 50 schools. So they're going backwards, not forwards. And 50 schools a year is obviously better than no schools a year, but it's not nearly as good as 400 schools a year, which is what the DfE thought it needed to do. Okay, this is important. So in that sense, with sort of sober, cold analysis, what that quote was doing really was highlighting how little the government has done. Yes. And Sunak's defence is that actually, even when the money was theoretically available to do more schools, to do 100 schools, only 50 schools a year were actually getting fixed. That's how much actually happened. We don't know why that is. Maybe, you know, we don't know whether it's that when they opened the buildings up, things were worse than they expected. So they got through the money faster, or, you know, it turned out to take longer than they thought. Everyone who's ever had a builder in knows how that works. Or maybe the scheme just wasn't very well managed. But for whatever reason, 50 seemed to be all the department could manage. And now you're looking back, you think, well, why weren't they all saying, well, that's not enough? How do we do more? What's gone wrong? You know, it would always be more understandable if it was something that kind of fell off the agenda a bit during COVID. And you could sort of see how that might have happened. But that's not what's happened here. It goes right back to 2010, when George Osborne was Chancellor, one of the first things he did was cut Labour's Building Schools for the Future programme, which was about repairing and rebuilding, you know, expanding, extending schools. He did have problems as a pregnant wasn't perfect. But we now know that at least 13 of these schools with rack in them, that are now in crisis, had would have been rebuilt under building schools. So they would have been fixed by now if that programme had survived. I mean, the sort of awful symbolism of this for the government could not be any worse, could it? In a couple of senses, really. One is that this falls into the midst of this sense that Britain is now a country that no longer works, where everything is unreliable and falling down. It so happens that all the headlines about the rack crisis are now being replaced. The rack crisis in schools have been accompanied by news that Birmingham City Council is now effectively bankrupt, right? So there is this steady sort of trickle. It's more than that, really. It's an ongoing deluge, really, of stories about the fact that the country doesn't work properly. That inevitably asks huge questions of the government. And I suppose then you've additionally got a question of competence, which is why on earth were schools only informed about this with mere days until the beginning of term? And the point is, this is a really visceral experience for lots and lots of people, or enough people that we can all empathise with, right? It's not some abstract notion. It's imagine your child in a classroom and the roof falling. Yeah, it's a very, very emotive thing in a way that, you know, normally kind of routine repairs and maintenance is not the sexiest thing that ever happened in Whitehall. You know, Rishi Sunak tried to defend himself in the Commons by saying that, oh, you know, this isn't what people were talking about. People weren't raising this in debates. Well, no, they weren't. It's not the kind of thing that necessarily makes the front page of the newspapers. But government shouldn't be defined by what are the most exciting things that make the front pages of the newspapers. You've got to do the bread and butter stuff as well. That sounds really boring right up until it isn't. And the moment it isn't is when a classroom collapses on front of a load of children. Or even when mitigation measures are being put in place to mean that kids can still be educated in school somehow. The experiences that leads to are very, very awful and they're very, very vivid. I speak from experience here. Because back in the early 1980s, a long time ago, when another conservative government had sort of withheld money from education, I spent a lot of my time at secondary school being taught in porter cabins. Horrible, old, smelly, cold, damp porter cabins. And they were always cold in winter. They never properly heated in our porter cabins as well. These ones were next to a railway line. And so one of my clearest memories is of my geography teacher having to stop teaching every five minutes as another train went past, right, because the porter cabins shook. And that's sort of what you're looking at, right? I mean, I wonder here whether this really is kind of it. On top of Partygate and everything else, all of these kind of very, very vivid scandals and crises that have fallen on this government in the last sort of two or three years, whether this one is so sort of vivid and visceral that there's no coming back. It also evokes more painful and recent memories, I think, for a lot of people, you know, the idea of kids being back learning at home again. None of us want to be back there. They've had so much disruption. All the, you know, children need stability and routine. They really, really needed to go back to school this term and it'd be normal. If this hadn't happened, what I had teachers and what ministers and what everyone in education wanted to be talking about was attendance, was, you know, how to get back the kids who've not really ever got back the habit of being in school from lockdown. And instead, there's yet more disruption. So all of that is piling misery on misery. And it comes, as you say, with, you know, it's only a few days after lots of people got stranded on their way home from holiday because their traffic control fell apart and he, you know, just that sense that you can't do your normal everyday thing because, you know, you can't get a train because everyone's strike and your hospital appointments have been cancelled because they're on strike and you can't get this to work and you can't get that to work. Eventually, just sheer frustration boils over. I was talking to someone last week who said, I voted, just like, and me saying I voted conservative for like, 50 years. And I'm not going to do it next time because it feels like nothing works. They just, they just, you know, nobody's in office more than five minutes and then they're moving on to the next person. No one seems to know what they're doing. It's that general sense of incompetence and mismanagement. And it's really affecting your everyday normal life in ways that you can't ignore. Sure. Let's pause here. When we come back, we will be joined by The Guardian's political correspondent, Alita Adoo, to look, among other things, at the Labour reshuffle. Well, well, well, shopping for a car? Yep. Carvana made financing a car as smooth as can be. Oh, yeah? I got pre-qualified instantly and had real terms personalized just for me. Doesn't get much smoother than that. Well, I got to browse thousands of car options on Carvana, all within my budget. Doesn't get much smoother than that. It does. I actually wanted a car that seemed out of my range, but I was able to add a co-signer and found my dream car. It doesn't get much. Oh, it gets smoother. It's getting delivered tomorrow. Visit Carvana.com or download the app to get pre-qualified today. Welcome back, Gabby and I are still here. And we're also saying hello to The Guardian's political correspondent, Alita Adoo. Hello, Alita. Hi, John. Before we get into the Labour Party reshuffle, let's just talk a bit about the Labour Party's role in the ongoing crisis surrounding rack and concrete in the public sector. And obviously they've done well out of this. The other thing that we've seen in the midst of the Labour Party making noise about this is that rarely glimpse thing, the Labour Party sense of humor. They did an online kind of image, which is circulated quite widely, referencing Jaws, which will make no sense to anyone under 50, I'm sure. But nonetheless, it says Jaws update most beachgoers not eaten by a big shark. This, as I said a moment ago, was in response to the government putting out an online image that said most schools unaffected. Alita, the Labour Party, I'm sure, can't believe it's luck, really. Yeah, it's insane. I mean, you know, the first week back for children, you know, they're really excited, ready to go. And obviously the government couldn't help themselves but create a scandal and a scandal that has only been made worse by the government ministers themselves. And I can tell you off the back of that, as you say, you referenced one of the ads, there's another ad that's been launched an hour ago from the Labour Party and they say, don't forget to thank Rishi Sunak for doing such an effing good job. That's in response to Gillian Keegan basically saying, why isn't anyone like patting me on the back? So I'm, we're not, we're doing a great job, essentially. It's going viral. Lots of chairs and retweets and comments going and I think it's a big turnaround, a critical time for Labour ahead of conference season, you know, they're keen to get things going. So we're going to talk about the reshuffle that Kirsten has just made, but I mean the last time Labour were getting lots of attention for their social media adverts, it was not really for a good reason. And then, notably, Steve Reed and the justice team had taken things a bit too far by leading on the advert that was criticising Rishi Sunak for not wanting people to go to jail for certain offences which, yeah, really didn't sit well with many people across many parties to be honest. And this seems like a gift that it's going to keep giving for Labour off the back of, you know, children not being safe in schools and parents panicking over how, you know, their children are going to continue studying really, it's terrible. Also when mockery enters the political conversation, if you're on the seething end of it, that tends to denote the fact that you're in a pretty awful position. Anyway, now in the midst of this awful week for the government, as we know, Keir Starmer carried out a big reshuffle in the shadow cabinet. The way this has been presented in most media outlets is as a huge boost to the Blairites and Blairism. One MP said in The Times, even Tony Blair didn't have this many Blairites in his cabinet. Is that the way you see it broadly speaking, Alita? Yes, I'd argue. I think we've seen some big promotions within the shadow cabinet going to not only Starmer's closest allies who have been working closely with him since he became leader in 2020, but also people that have a wealth of experience from the Blair years, from the Brown years. So let's start with Pat McFadden. He's got a massive promotion, obvious like unashamed Blairite. You know, he's seen as one of the first figures to have quit Jeremy Corbyn's cabinet back in January 2016, something that I'm sure he would hold as a badge of honour, something that his allies have said. So he's gone from being Chief Secretary to the Treasury to becoming Labour's national campaign coordinator, and also getting the huge responsibility of working as a shadow cabinet office secretary. So he'll also be responsible for, you know, the machinery of government issues and essentially having a huge weight of being able to shape the direction of Keir Starmer's party. Obviously, I said he had a wealth of experience from the Blair years. He worked as a senior adviser to Tony Blair after the 1997 landslide win. Also to have a discussion about Blairites that are key winners in this reshuffle. We've got Liz Kendall. Liz Kendall, he stood for party leader in a bid to sort of get rid of Jeremy Corbyn. And finish last. She finished last. She finished last. But not only has her former leadership campaign manager Morgan McSweeney also made a huge deal of himself in the last few years, but she now has got the shadow work and pensions brief off of Jonathan Ashworth. So she's seen as firmly right on the party and she's an unashamed Starmerite. We've also got Hilary Benn. He's got the Northern Ireland brief. It's funny, literally less than an hour after he was promoted back into shadow cabinet, he was in the Commons chamber making a really passionate speech about his brief and, you know, senior officials are saying that's, you know, testament to the wealth of experience that he has, but also his talent. And he made one of the most iconic speeches, in my opinion, in the Commons chamber back in 2015 when he was closing a debate on airstrikes against ISIS in Syria. And funnily enough, that was against the position of the then party leader Jeremy Corbyn, also putting him in a great state to show his allegiance to the Starmer leadership. So yeah, it's a combination really of people with a long history and that long history goes back into the new Labour period and Tony Blair's domination of the party in particular. Gabby, is that your reading of it? That this does tell you something politically significant? Yeah, I mean, I have to say as someone who was doing a leader's job during the Blair years, a lot of these people are very familiar to me. So yeah, it is there is definite sense of deja vu. But what I think he's gone for, obviously, you know, there is an ideological twist to this, you know, the cabinet is weighted differently, the shadow cabinet is weighted differently than it was. But there are two things I think one is he's gone for people with experience in government, so you just mentioning Hilary Benn, you know, was in cabinet under Gordon Brown. That's why he manages to pick up a brief really smoothly. There are people who know how to run a government department, how Whitehall works, who if they were going into government in a year's time, aren't going to have to suddenly work it all out from scratch in the middle of a crisis. He's looking for experience. So Pat McFadden, you know, was an absolutely integral part of the number 10 machine under Blair, although he's one of those people like Alistair Campbell, one of those people who was very, very loyal to Blair, but probably more loyal even than that to the Labour Party, you know, and he did manage to keep feeding all sorts of different camps and relationships with all sorts of wings of the party. Liz Kendall was a special adviser in DWP, the department she would be cabinet minister for if there was an election tomorrow in 1997. She was there through a tough year with very strong parallels to the one that's coming up, I suspect, given the cuts alone, parent benefits that her boss was pushing through at the time. So he's gone for institutional experience. The second thing he's gone for is toughness, people who won't collapse under fire in an election campaign. So you've got Steve Reed at DEFRA, you know, he's a sort of street fighter type, I think they're partly to attack the Tories, everything's like Suge. He'd like us to think that of him, yes. As far as politicians ever are. Up close, he's a bit more half a lager than that, but I understand. I know, but also to defend, if you look up, that's what he's there to do. He's there to defend, to attack Tories over Suge and defend against Tory attacks on environmental policy, because they'd like to portray Labour as a sort of tree-hugging, knit-your-own-yoghurt-type, and he's not that. But what I can particularly see this time is a nucleus forming of people who are close to each other ideologically and personally, now in critical numbers. You've got Peter Kyle, Wes Streeting, Liz Kendall, Pam McFadden, Steve Reed, lots of them also close to Morgan McSweeney. And they remind me a bit of a caucus that developed around Blair of supportive ministers who backed him up, but also backed each other up when they were sort of hitting the fire. And that's that we haven't had before. That's a critical mass of people who think alike. Alita, here's a question. Why was Lisa Nandy demoted? Up until now she'd been the shadow levelling-up secretary, very much a sort of standard bearer for what we know as the soft left. So not really with Starmour's politics, but seen as being a pretty effective minister, certainly in the Commons, right? And finished pretty respectably in the last Labour leadership election. And she's been really, really demoted. It's really interesting, John, because she's somebody that was well regarded across all sides, I can say, of the Labour Party, of the membership, of the NEC. She's somebody who is seen as having the rare ability as an MP to actually speak like a human and connect with people and land arguments really effectively in the Commons chamber, arguing for all sorts of issues within what's a really tricky brief at the moment, particularly the housing brief. You can note how many U-turns the party's made on that recently. But it's been really interesting to hear from some insiders who are close to the Starmour machine who are saying that, oh, you know, she's had this coming for at least a year now. When she's really switched on, she's electric, she dazzles, she wows, even. But when she's not in the chamber, it's almost as if she doesn't exist, there's nobody in the brief, and she's not really landing any punches or not really pushing the agenda policy-wise. Somebody else told me that she's not really landing a distinctive enough response on Labour's levelling-up brief away from what the government is setting on their levelling-up agenda. But I mean, as somebody who's seen as having an amazing future, somebody who's once regarded as a future leader, even a future deputy leader, to essentially now having been demoted from an incredible brief, something that she knew really a lot about personally, to be demoted to working under David Lammy within a department that she once held, that she once led, which is the Foreign Brief. It's quite an embarrassment, and she's taken it on the chin and is determined to continue working with the machine. But ultimately, we must remember, while she's able to attend Shadow Cabinet in this number two Shadow Foreign Office and Development brief, if Labour was in government now, she wouldn't be allowed to attend Cabinet, and that's almost quite embarrassing. In the way you answered that question, there was a certain bafflement, and I suppose that bafflement is answered by the fact that really, notwithstanding what they say about her supposedly underperformer, which I think is probably a bit unfair, it's mostly a factional move, right? This is to do with a way of looking at the world becoming dominant, to the point it almost looks monolithic in the Shadow Cabinet. And Lisa Nandy, as the most visible, I suppose, representative of the soft left, apart from Ed Miliband, who now looks quite lonely, in that sense, she was bound to be in the firing line. Yes, absolutely. And many, a number of Labour MPs have said, well, she's been preparing for this for months, obviously it's not going to come as a surprise. Keir Starmer said to have done all of these reshuffle appointments and demotions over the phone. And there is a funny rumour that's going around saying that he was alluding to the fact that he could have easily given her a different job, but was saying, oh, this is a really important job, you're going to do it very well. Almost like pat on the back, you know, suck it up, don't complain too loudly, just be grateful you're still within the front bench, which is a bit of an embarrassment. Compared to his most illustrious predecessor, Tony Blair, Gabby, even by Blair's standards at this stage in the political cycle, this is quite ruthless stuff from Keir Starmer, isn't it? Tony Blair's Shadow Cabinet, at a comparable point, was much more politically balanced than this one has turned out to be. Yeah, although you have to bear in mind that this is, you know, Blair certainly didn't put the Shadow Cabinet that he had in opposition straight into government. There were some changes at the last minute. This is not necessarily the team that's going to come through into actual government. I personally think it's a shame that Lisa Nandy's been sidelined. She's a really interesting voice, but Angela Rayner coming in as levelling up Secretary is going to be really interesting. I mean, particularly struck for me to have someone who was brought up in a council house that becomes Secretary of State for Housing, that feels like it should change something, should unlock something that's been missing before from the housing brief. You do have Rayner in that position, what was the old John Prescott position, I suppose, which is the deputy leader who very definitely isn't a Blairite and has wider reach and has their own power base and needs to be able to talk to bits of the party that Starmer can't talk to, but she's quite isolated. You know, there aren't many other people backing her up and it'll be interesting to see how that relationship develops over time. It was clearly very fraught at one point. It's less fraught now. But you can, this is probably the moment when the party is at sort of maximum unity when they're ahead in the polls and everything's going great and they're all looking forward to being in government six months in when, you know, everyone's having to take on popular decisions. That's when the cracks tend to emerge. OK, just to mention as we close something we've talked about a lot in politics with the UK in relation to Keir Starmer. I mean, Keir Starmer has been on hell of a journey and that's been charitable. If you look at the platform that he stood on for the leadership, right, and what this reshuffle tells you about his politics and where he wants to take the party and the country for that matter, there is something mind boggling about that, isn't there? Yeah, I mean, he's moved, first of all, the policy changed, now the people have changed. He's barely recognisable from the old version. And I'm sure there are people, there are lots of people who voted for Keir Starmer in the leadership election precisely because this is what they thought he was going to do and what they wanted him to do. And there will be people who voted for him thinking, believing, you know, that he was continuity Jeremy Corbyn who will now be appalled. And he'll hope that those people will be sort of mollified by winning an election and having a Labour government. But it is a, it's a heck of a leap, as we always keep saying, you know, don't underestimate Keir Starmer. Don't underestimate the ruthlessness, don't underestimate, also don't kind of count him out. You're agreeing by the sound of it, Elita, in the sense that although he's made out to be this sort of slightly wimpy guy with an adenoidal voice, the sheer distance that he has come, albeit in a very cynical way from where he stood for the leadership, shows you that he's not that at all. He's a very, very ruthless, determined, willful individual. Yes, and he's incredibly ambitious and this is something that even, you know, lawyers that worked with him when he was, you know, director of public prosecutions remember about him. He's extremely ambitious and he will do whatever it takes to win. This is something, a line that, you know, his allies repeat all the time, his closest officials are constantly parroting, ensuring that MPs are constantly repeating this when they're going on morning rounds. And he will do whatever it takes to win and clearly that means if it's just narrowing, you know, the diversity of thoughts within the shadow cabinet on the front bench, for example, making as many U-turns as they have to in order to convince the electorate that, you know, they are ready to govern. They can be trusted with the public's finances, for example. So the weird thing when we talk about, you know, Stammer appointing his close chums and people who are close to him is that I don't really, I'm not really sure that I would characterize anyone in the shadow cabinet as enormously close to. I don't think he's the sort of person who has close chums. I think even, you know, some of those people who've been promoted this time or, you know, have moved up the ranks wouldn't necessarily say they were personally close to him. I'm not sure who would say they were personally close to him. There's something, there's a remoteness between him and the rest of them that there wasn't between Blair and his cabinet, I think, who were, you know, all the sort of Blairites with them were a sort of unshakable kind of alliance. You don't quite get that feeling with Stammer and his cabinet. It still hasn't quite melded somehow. We await that melding. The next thing we are told in the Labour Party's plan looking ahead to conference is that it will at last tell us in great detail what exactly it's going to do with power. Meanwhile, we may have over a year of the country carrying on falling down. What a great thing to look forward to. Anyway, we will leave it there for now amid the rubble. Thank you for joining us, Alita and Gabby. Thank you so much. Thank you. Thank you for listening. I hope you enjoyed today's episode. If you did, make sure you subscribe to Politics Weekly UK wherever you get your podcasts and please leave us a review, preferably a nice one. Now, before you go, the Guardians podcast, Pop Culture with Shanté Joseph, is coming to the stage for the very first time. Shanté is going to be joined by the matchmaking expert, author, entrepreneur and television host Paul C. Brunson. Together they will go behind the scenes to discuss the dynamics of TV dating, the key to a successful relationship and how pop culture plays a significant role in all our love lives, whether we want it to or not. It's going to be live at this year's London Podcast Festival at King's Place on Sunday, September the 17th at 2pm. It's also going to be available to stream globally. For tickets, you need to go to this podcast page. This episode was produced by Frankie Toby. The music is by Axel Krakutje. The executive producers are Maz Ebtahaj and Nicole Jackson. This is The Guardian."}, "podcast_summary": "In this podcast summary, children being sat in classrooms under metal props due to the presence of reinforced autoclaved aerated concrete (RAAC) is discussed as a scandalous and symbolic issue reflecting the government's response to austerity and cutbacks in the maintenance of public buildings. The podcast also includes an interview with James Saunders, the head teacher of Honeywood School in Essex, one of the affected schools, who explains the disruption caused by 22 classrooms being out of action. The government's poor handling of the crisis is criticized, including the communication techniques used. The Labour Party is highlighted as capitalizing on the government's missteps by sharing humorous summaries of the government's response on social media. The Labour Party's recent reshuffle is also discussed, with the appointment of various figures seen as aligned with the Blairite faction of the party. The demotion of Lisa Nandy, a representative of the soft left, is noted, leading to speculation that the reshuffle signals a move towards Blairism within the party. The reshuffle is seen as a strategic move aimed at fostering political balance, promoting experience in government, and selecting tough individuals who can withstand election campaigns. The motivations behind Keir Starmer's reshuffle are questioned, with both ideological considerations and the desire for a united and effective frontbench cited as factors. The article concludes with a reflection on the ruthlessness of Starmer's reshuffle, highlighting the distance he has moved from his previous platform.", "podcast_guest": {"name": "Gabby Hintzliff", "org": "", "title": "", "summary": "Not Avialable"}, "podcast_highlights": "The five most significant moments in the podcast are:\n\n1. Gabby Hinsliff on the concerns surrounding RAC and the government's response.\n2. James Saunders, head teacher at Honeywood School, discussing the impact of the RAC crisis on students and staff.\n3. Rishi Sunak's response to criticism of the government's handling of the RAC issue.\n4. Gabby Hinsliff on the symbolic significance of the RAC crisis and Tory cuts.\n5. Alita Adu on the reshuffle in the Labour Party and the presence of Blairites in key positions."}