{"podcast_details": {"podcast_title": "CNN Inside Politics", "episode_title": "Americans are deeply unhappy with Joe Biden", "episode_image": "https://www.omnycontent.com/d/playlist/d83f52e4-2455-47f4-982e-ab790120b954/0662f610-d693-473a-b06a-ab86010e979c/8a5860a3-0e13-40eb-93e5-ab86010e97a0/image.jpg?t=1686602416&size=Large", "episode_transcript": " Today on Inside Politics, there is no way to spin this. CNN reads the country's mood right now and finds that America is deeply unhappy with Joe Biden. Most Democratic voters hope for a change at the top of the ticket, and Americans don't take the president and his word when he talks about his son, Hunter. Plus a deal he couldn't refuse. Trump employee number four flips after the government promises to shield the Mar-a-Lago IT manager from prosecution. And a road to ruin paved by the former president. Mike Pence warns that Republicans are headed for extinction, but is anyone in what is very much still Trump's GOP listening? Chris Christie will be here to talk about that and more in moments. I'm Dana Bash. Let's go behind the headlines and Inside Politics. Up first, our new poll has important new takeaways about 2024. There is deep rooted dissatisfaction with the incumbent and the direction he is taking the country. There are even deeper doubts about if Mr. Biden is up to the job again. CNN's David Chalian is standing by for us at the magic wall. David, these numbers are just not good if you are a sitting president of the United States. Show us what they tell us. Yeah, there's no doubt about that, Dana. This is setting off alarm bells inside the Biden campaign in the White House. Overall, his approval rating is down now at 39% approved. So more than six in 10 Americans disapprove of the job he's doing. And you see he's been hovering here for a little bit, Dana, since the spring. You mentioned that Democrats would like somebody other than Biden as the nominee of their party. That is dramatically so. Two thirds of Democratic and Democratic leaning voters say that they would like a different candidate to be the Democratic nominee. Only a third of Democrats and Democratic leaners say they want Joe Biden to be the nominee. And we asked this open ended question of Democrats and Democratic leaners. What is your biggest concern about a Biden candidacy? It's not even close, Dana. 49% say it's his age, 7% mental sharpness, 7% health, ability to do the job. This is all related to Joe Biden being the oldest president currently serving and obviously asking the country to renew his contract for four million years beyond next year. And what about a potential Biden Trump rematch? What do our numbers say about that? Dana, it is a dead heat race, basically. 47% Trump, 46% Biden. This is the first time we at CNN this cycle have tested a general election matchup like this. And this is no clear leader, well within the margin of error, a real dead heat contest. And you know what? It's not a contest many Americans are all that psyched about. I mean, look at their favorability numbers. They're the same. 35% of Americans have a favorable view of Joe Biden. 35% of Americans in this poll have a favorable view of Donald Trump. And Dana, look at some of these attributes for the president. He doesn't have majority support for any of them. 45% of Americans says he cares about people like you. 33% say they're proud to have Biden as a president. Only 28% of Americans says that the president inspires confidence. Dana. Wow. Pretty incredible numbers there. David, please don't go anywhere because I want to get back to you in a minute. But first I want to digest what David just showed us with CNN's Jeff Zeleny, CNN's Kristen Holmes and CNN's Daniel Strauss. Now I am guessing, as David mentioned, and I'm sure all of you who are excellent reporters have done the same. You've been talking to people inside Biden world and even though I started the program saying there's no way to spin this, I will tell you what a source before coming on with you guys told me. They haven't started really advertising and earnest. They haven't started organizing. They haven't started spending the money that they have in a big way and that it is very early and so on and so forth. Having said that, reality checks Jeff Zeleny. Look all of that is true but the president has the biggest megaphone of anyone on the planet. So yes, they haven't started spending a ton of money although they are on the air and they're starting with the NFL season that opens tonight. But look, he is out there every day. And so while it's true that there's no question that some of these factors are likely to go up in terms of his economic policies, his programs, people just don't know what is in all these big pieces of legislation. So that may be true. But the spin that it's impossible to spin is on the president himself, on his age, on what people think and see and feel when they see him. He cannot change. He is 80 years old. He walks slowly. He sometimes speaks with gaffes as he has done for years. So they sort of put some context on it. But the reality is people look at him and just do not see confidence. The question here is though I think probably one of the biggest concerns I heard from someone this morning, the excitement factor. Democrats and voters who voted for him are not excited. That opens the door to potentially a third party candidate, which we've talked a lot about on this program. Andrew Wilrobin. And that is a big problem for them. Yeah. And you mentioned one of the numbers that David showed us is the age factor and how concerned it appears that voters, Democratic voters are about that. One of the ways that they have started spending money in the Biden re-election campaign is on a brand new ad where they try to point out a couple of things. One is the president's what he's done on the world stage, particularly with Ukraine, but as part of that about the stamina that he had in order to get into Ukraine. Let's watch a bit of that. He entered Ukraine under the cover of night. And in the morning, Joe Biden walked shoulder to shoulder with our allies in the war torn streets. In the middle of a war zone, Joe Biden showed the world what America is made of. That's the quiet strength of a true leader who doesn't back down to a dictator. Look, I think that there is a key phrase in that ad, a quiet strength, which does not elicit overwhelming energy or outsized noise. And that's clearly an acknowledgment that to Biden's handlers this is the product they have to sell, that it's going to be a candidate who's compared to the alternative, as he likes to say, not the almighty, that they are looking for a contrast to win this election, not necessarily just selling Biden after his first term and on what he's wearing, which by the way this administration feels very good about, but clearly our polling shows that it's just not getting to voters. They are not making the connection. And let's talk about the alternatives and not the almighty, the potential alternatives, because we also asked those questions in CNN's poll. If you look at Joe Biden, who is on the right there, how he matches up against all of the leading Republican candidates, Nikki Haley does the best. I mean, there's a margin of error there between her and Donald Trump, DeSantis and so forth. The bottom line is that he's not beating any of these people except within the margin of error, except Vivek Ramaswamy. Yeah. So just one thing I want to note about the ad that you just said is that it is a powerful ad, but I think what Jeff was saying is so important, which is that that's not the Biden that people see every single day. And the president has the largest megaphone, and that's not what people are actually taking in when they see Joe Biden. So one ad is not impacting the voters as much as what they actually see every day. Now, in terms of that matchup, look, I talked to the Trump people. They've been putting out this post talking about how he has a lead. We had another poll earlier this week that had him with a huge lead in the Republican primary field. They're very happy about that. I do think this is just a lot of alarm bells. And I think as it all comes down to talking about this excitement factor, I do think that the Nikki Haley thing is really interesting. It's something that Jeff and I have talked about a lot being on the trail. We know that Haley's people were really banking on that first debate and they think that they can sell her as someone, one of the only people who can beat Biden. So obviously this is something they're going to leave. I've already gotten the email from her, because the campaign, I'm guessing all of you have as well. I want to bring David back in because, David, there are other numbers in this poll that shows that Americans doubt President Biden when he says this. Your son's former business associates is claiming that you were on speakerphone a lot with them talking business. Is that what? Never talk business in England. And I know you'd have a lousy question. David, what do voters believe or not believe when it comes to Joe Biden and any dealings that he had with his son and his son's business dealings? And I should say there has been no evidence that there has been any. What do voters believe? Yeah. And we're talking about, Dana, here, the time when he was vice president, right? Whether Joe Biden was involved in Hunter Biden's business dealings at the time he served as vice president. Overall, if you look here, 61% of Americans think Joe Biden was involved. You can see partisanship drives this, right? Nearly all Republicans, 90%, believe that. This has been a major storyline and talking point on Fox News and elsewhere. 64% of independents believe that Biden was involved in Hunter's business dealings. 28% of Democrats. And I want to show you of that 61% overall there that believe he had dealings, 42%, Dana, think that Joe Biden acted illegally when he was vice president in those business dealings. 38% say not involved, 18% said he acted unethically, but not illegally. But that is a significant number as well. And when you look here about President Biden now serving as president, his actions in the Hunter Biden probe, have they been appropriate or not? 55% of Americans, a majority, believe Biden's actions related to the Hunter Biden probe, inappropriate. 24% of Democrats, again, a majority of independents, 52%, and nearly all Republicans at 19%. 90% believe that. And this is to show what happens when you don't push back at all, which is really basically what the White House has been doing. There's not been a Hunter Biden defense kind of mounted in a public relations way, and it's starting to seep through beyond just the right wing echo chamber we're seeing. That's so true. Thank you so much for those, again, stunning numbers, David. What David said is so true. I have heard from people in and around Hunter Biden's world for some time, incredible frustration that his father, the president, and more importantly, the Democrats who are in this sort of strategist world have not been mounting a defense. Because if you let things hang out there, I mean, how many examples do we have in modern politics? If you don't answer something and if you don't push back against something, particularly something that there is no evidence of, it's going to seep into the zeitgeist. And that seems to be what is happening, at least according to this poll. Yeah. And I think that, I mean, especially with something like this, where they are putting this out there, Republicans on every level, they are doing investigations in the House, you have all of the presidential candidates talking about this, you have these Republican operatives talking about this, they are on this message nonstop. And it's not just on Fox. I mean, they're saying it in rallies. They're talking about it on social media. I mean, this is their talking point or one of their very big talking points right now, particularly when you look at the far right. I have heard from a number of Democrats who have told me that they wish that they would push back or even say anything at all, because right now it feels as though they're just getting completely clobbered. Yeah. And what they say at the White House and again inside Biden world is this is what he ran on to separate himself from the Justice Department, that there is a DOJ probe and he doesn't want to do anything to step on that. OK, fine. But then we have some brand new reporting that's on CNN.com right now from Annie Greer at Kayla Towsche and Lauren Fox talking to Democrats on Capitol Hill who are frustrated. And Eric Swalwell said the following, this is a congressman from California, I fear we are missing an opportunity here to put Republicans back on their heels to say it is pretty sick that someone who is in recovery talking about Hunter Biden and trying to redeem themselves is subjected to these political attacks for something that happened before Joe Biden was president with no evidence that Joe Biden did anything wrong. Yeah, look, and that frustration is partially because, as Kristen was just saying, that the Hunter Biden investigation is the knee-jerk response to any questions your average Republican congressman is, congressperson faces about Donald Trump and the 90-some felonies he's facing right now. So there's like any time I ask any congressperson about it, they will say something like, yeah, but look at the Hunter Biden investigation and look at the Hunter Biden corruption. It's not the same, but that's it clearly across the political ecosystem on the right. This is the response at the end. Are you hearing this on the trail? For sure, but the reality here is, I mean, the president, you have to view this in a couple ways. He is a father first and foremost, so no one in his orbit wants to talk about this either. That's why this is such an unusual and really unique topic here. So it's understandable why the president wouldn't want to talk about it, but because he does not want to talk about it, it sort of creates this ripple effect of no one wanting to talk about it except Republicans. But the facts aren't necessarily always great either. We got news yesterday that there's likely to be an indictment here, so it's not like there is a defense just sort of awaiting to be had that is not being uttered. This is a complicated case in every way, and there could be a trial playing out at the same time of the primary in the campaign next year. Democrats who have talked, they say that never stopped Donald Trump, and he certainly rewrote the playbook on that. It didn't, but Joe Biden ran to be different than Donald Trump. Exactly. That's exactly right. Everybody stand by. Donald Trump has a problem no one on trial ever wants. One of his employees just flipped. More on that in minutes. This week on The Assignment with me, Audie Cornish. Throughout the life of this podcast, we've asked you, our wonderful listeners, to pick up the phone and leave us assignments. And you know what? You delivered. I think it would be interesting to look into Montana politics. Used to be a blue state and now we're almost completely red. Here's what we did. We took three of your assignments and then called up three reporters who could give us some answers. Listen to The Assignment with me, Audie Cornish, on Apple Podcasts, Spotify, iHeartRadio, or your favorite podcast app. Your favorite 90 Day Couples are back and they're in therapy on 90 Day, The Last Resort. We're here because we've had a lot of issues with infidelity. On 90 Day, The Last Resort Sessions, the official podcast, we break down what happened in couples therapy on that week's episode. I'm not taking it. I took it a whole year with my husband lying, cheating. And offer insights into how to make your own relationship thrive. As a therapist, I do not believe the hall pass is a good idea at all. Listen to 90 Day, The Last Resort, wherever you get your podcasts. In court, a promise to make October 23 stick. A Georgia judge said he wants to keep the trial for two Trump co-defendants on the fast track. CNN's Sarah Murray has more. Sarah, let's look ahead. October 23rd seems like that's a go for those two, Cheesebro and the other one of Trump's lawyers. The question is, the big question, is Trump himself? Yeah, that's right, Tana. The judge was very decisive from the bench yesterday and basically saying that Kenneth Cheesebro and Sidney Powell are both going to go to trial in October of this year and they're going to go to trial together, even though that's not what they wanted. But he was much more skeptical about the district attorney's office still pushing to have all 19 of these defendants, including Donald Trump, going to trial in October of this year. Take a listen to what he said really gets to the heart of some of his skepticism. I don't know how many hearings we're going to need to have to sort through all those. But if we compress our timeline to 40 something days, our ability to even be able to really weigh those and think through these issues again, it just seems a bit unrealistic to think that we can handle all 19 and 40 something days. Now, one of the issues the judge is referring to there is that a number of defendants, including Mark Meadows, are trying to move this case to federal court. So that's something that still needs to be litigated. And look, the district attorney's office laid out a potentially long trial ahead for these defendants saying it could take at least four months minus jury selection or as well as jury selection to move ahead. And there could be 150 witnesses, Dana. Incredible. Thank you so much, Sarah, for that reporting. And now let's turn to Mar-a-Lago and the documents case. Accord filing puts Donald Trump's lawyers on notice. A former Mar-a-Lago employee, the compound's IT manager, is now cooperating with the special counsel's team. Joining the conversation, CNN's Evan Perez and former federal prosecutor Ellie Honig. Evan, let me start with you because this question of this IT manager, he was the sort of Trump employee that was in the shadows. We didn't know who he was. We didn't know what was going on. And now we do. The special counsel's court filing said immediately after receiving new counsel, Trump employee number four retracted his prior false testimony and provided information that implicated NADA, Walt NADA, De Olivaera and Trump in efforts to delete security camera footage as set forth in the superseding indictment. Right. And so this was the first explicit really acknowledgement of what happened that we've all suspected was happening. Especially when we saw the superseding indictment and we'd heard, you know, some of our reporters who've been on this story, including Caitlin Collins and Caitlin Pollance, had heard that there had been someone who had changed their story under pressure from the prosecution. And so that's what explains all of what happened and what you see in that superseding indictment. What's also I think interesting is that, you know, what prosecutors keep kind of going around is the idea that there are a number of people who are represented by people who are paid, lawyers who are paid for by Trump's political committee. And they're trying their best to keep things together, to keep their story straight. And this guy, Yussel Tavares, he's only identified as employee four in the documents. He is the first one to sort of break away from that and sort of expose what has been happening. So it's going to be interesting to see how the judge handles this. Prosecutors want a hearing to address some of these obvious conflicts. They say there are obvious conflicts. The lawyers are trying to push back on that. And Ellie, as a federal prosecutor, you have flipped witnesses before. What do you have to what did they have to promise to give in order to so here in order to give them immunity or a deal or whatever it is that he's likely getting in order to get his testimony? Yeah. So here's how the deal works. The cooperator, first of all, has to tell you everything he knows. He has to tell you everything about his own conduct and anything he may know about anyone else. There is no partial cooperation. You have to come clean with everything. In an instance like this, as Evan was saying, where the person lied initially by denying it, that happens. That happens all the time. The question for the prosecutor really is, is this person now at a point where he has come clean? And in return, what the cooperator gets, this is a transaction, is a sentencing benefit. Sometimes you have to take a guilty plea and you get hopefully a reduced sentence from the cooperator's perspective. In this instance, where the conduct is, in prosecutors view, less significant, you can get a free pass. And it looks like that's the deal that prosecutors have reached here with Mr. Tavares. You're going to testify for us. You're going to tell everything you know about Donald Trump and Walt Notta and Mr. DeOliveira, and we're going to give you a free pass. Very common deal, crucial to prosecutors building their case. And Evan, I want to turn to what happened yesterday in the Hunter Biden case. Legally, the now special counsel, David Weiss, said the following, the government intends to seek the return of an indictment. This is specifically on one charge, that is a gun charge. There are other tax charges which we don't know about yet. This was one of the things that was supposed to be taken care of in that plea deal that fell apart at the 11th hour. Right. And really, I think if you look at the statement from Hunter Biden's attorneys, they think that the deal is still operative. They say he's been going to the probation office, that he has been abiding by his side of it, and that the prosecutors have to live up to their side of it. The prosecution says, no, there is no deal because it was not signed by the probation office. So what we now have is we're surely going to see some litigation on this. Hunter Biden's lawyers are not going to just take this. But we are going to likely see an indictment by the end of the month of the sitting president's son, which is historic, obviously. And we may also soon see charges related to his taxes in Los Angeles and Washington, D.C., all because he came within minutes of really having this deal signed off on and completed, and then everything just fell apart spectacularly in court. And real quick, Ellie, as Evan said, a sitting president, his Justice Department likely indicting and trying to take to trial his son, the president's son. Yeah, Dan, DOJ has given me whiplash on this one because six weeks ago they did walk into court and they were ready to get rid of this case for a misdemeanor and dismiss the gun charge. Now they're about to indict him for a felony gun charge, which would likely carry jail time if there's a conviction. The only conclusion that I think is consistent with all this is that the whistleblowers were right, that initially DOJ was ready to go in there and give this deal away cheaply. And when the political pressure amped up, DOJ did a complete 180. And now they've made David Weiss special counsel and now they're bringing an indictment. Yeah. And as you know, the Hunter Biden people want a lot more questions asked about those whistleblowers, whether or not they were actually the leakers turned whistleblowers. That's a whole different conversation. Thank you so much for your reporting and insights. Donald Trump makes a promise he's broken before to testify under oath in open court. Up next, I'll ask one of Trump's challengers for the Republican presidential nomination, Chris Christie, about that and much more. It's a law and order plotline turned reality for the former president of the United States. We learned from a court filing that the IT manager at Donald Trump's Mar-a-Lago property is now a government witness after the special counsel offered him immunity from prosecution. Joining me now from Mendon, New Jersey is Republican presidential candidate and former governor of the Garden State, Chris Christie. Thank you so much for joining me. You are also a former U.S. attorney. You prosecuted lots of high profile cases. How valuable do you think this cooperation could be? Very valuable because this is a guy who has firsthand knowledge of what went on in the aftermath of the subpoena, grand jury subpoena being served. What were the machinations of the people around Donald Trump and perhaps of Donald Trump himself? And so while it's not a make or break bit of testimony, I don't think it's another building block in having people who are cooperating now against Donald Trump and going to give testimony about his conduct. And that cannot be a comfortable moment for him. Well that was going to be my next question. You were still in his orbit and work with him. You were friends with him. You saw what happened when Michael Cohen flipped. Given that, how might he be feeling about this right now? Well two things will happen. One this man will be vilified, attacked and savaged by Donald Trump publicly. And then secondly, Donald Trump will lay in his bed at night staring up at the ceiling trying to remember every conversation he ever had with this guy while he's sick to his stomach. And this is going to repeat itself over and over and over again over the course of the next number of months. It's going to repeat itself in Georgia when some of those co-defendants invariably are going to take a plea and a cooperation deal and will cooperate against Donald Trump. And it may happen again in this matter, in the federal matters that are pending with folks who are either indicted or unindicted co-conspirators. And so this is what the Republican Party is facing. Drip, drip, drip on the guy who is the front runner, which is why he cannot be the nominee. And if he is the nominee, he will not beat Joe Biden. You have been in this race for three months as of yesterday. You've spent a lot of time hammering the former president and saying things like you just said, drip, drip, drip. He is not the guy that the Republican Party should have to go against Joe Biden. Meanwhile, the former president's lead has actually expanded. We saw it not just in a new national CNN poll this week, but in early contest dates where these will be decided. Why do you think Republican voters aren't buying the anti-Trump message that you're selling? Well, first off, I think a lot of them are. And we're at 14 percent in New Hampshire and we're going to continue to climb in New Hampshire. I suspect. But secondly, look, this is going to take some time, Dana. This is a guy who has been at the front of every Republican voter's mind for the last eight years. And it's not going to happen overnight. But as these things become more and more real, as the trials approach and as they do approach, you're going to see more of what happened now with this cooperating witness. It will become more real to people. And when it does, they're going to realize that we just simply cannot nominate Donald Trump. Whether you think the indictments are fair or unfair as a Republican, they are a reality. We now have to deal with them and his underlying conduct that caused them. And both of those things, in my view, are disqualifying for him as a candidate. And I think that Republican voters will ultimately come around. But they're not going to come around without people like me being out there continuing to make this point patiently and with persistence. And that's exactly what I'm going to do, Dana, because it's the truth. You know, you've touted your support, not just from the 14 percent that you just mentioned in New Hampshire, from more broadly Democrats and independents, who you say that you're going to need in order to win a general election, you or any Republican. And the question is, what if that same appeal is turning off Republican voters, that you need to win the primary? Sixty six percent of GOP voters in that CNN poll said that they would never vote for you, which was the highest of any candidate in that race. Is that the result of the message that you continue to push? Sure. It's a result of the fact that there are a lot of people who are uncomfortable at this moment with the truth being told about Donald Trump. But that will change over time. And the fact is that you have a party that's divided essentially into three lots, one that's with Trump no matter what. Another part of the party that is against Trump no matter what. And then the third part of the party that says I might vote for Trump, but I am definitely willing to consider an alternative that could be Joe Biden. I'm appealing to those people who are in that middle, that alternative folks, the folks who are looking for an alternative and also for the folks who would never vote for Donald Trump. And look, any of the other folks who say they're for Trump right now and unwilling to change their mind, who does change their mind, we'll be willing to welcome them too. Here in Washington, House Republicans are making noise about launching an impeachment inquiry into President Biden related to his son Hunter's business dealings. Just on the simple question of impeachment, is that the right way to go for House Republicans? I don't think bringing an impeachment, articles of impeachment right now is the right thing to do. I think that the fact is that we don't have the evidence to do that at this point. But I do think given everything we just heard in the last segment about the Hunter Biden situation, the fact that they're now willing to do this means that either the fix was in the last time or there was rank and competence on someone's part because these things were obvious to me in the weeks before the Hunter Biden plea deal. All of that smoke and fire around Hunter Biden definitely makes us absolutely need to ask questions about whether or not the president was involved in Hunter's business dealings. And however the House chooses to do that, whether it's through their oversight function or some other mechanism, I think it's right for them to do it, but not just them. The special counsel needs to be doing it as well. Before I let you go, Donald Trump says he does not plan to attend the next Republican presidential debate, but he did say recently that he would debate the Duchess of Sussex, Meghan Markle, because he doesn't like the way she dealt with the Queen. You're smiling. Look, he says so many ridiculous things. I think there is absolutely no interest in either Donald Trump or Meghan Markle debating about anything. And if people really want to have the real issues that are concerning their lives, like inflation, our role around the world, our troubled education system, crime and law and order in our cities debated, we need to have serious candidates on that stage. I tell all people, go to ChrisChristie.com, donate, keep me on that stage and keep plugging. We're going to keep telling the truth, Dana, and let him go and talk to Meghan Markle. Maybe they can have a Spotify broadcast together. Oh, OK. Those are fighting words. Governor, thank you so much. Appreciate you coming on. Dana, thanks for having me. More on Inside Politics after a quick break. This morning on CNN, former Vice President Mike Pence said his party faces a time of choosing. I thought it was important to seize that moment at St. Anselm College and really lay out what I think is a clear choice for Republicans, whether we're going to continue on the path of those time-honored conservative principles of strong national defense, American leadership on the world stage, limited government, fiscal responsibility and reform, a commitment to the right to life and values, or whether we're going to follow what I call the siren song of populism unmoored to conservative principles. My former running mate, frankly, some of his imitators in this field are increasingly walking away from all those same principles. But are his words resonating with Republican voters? My panel is back here. You go out in the field. I mean, everybody talks to sources and so forth. But you were most recently in New Hampshire. And you talked to voters there. I'm going to play a clip from a voter in a second. But just generally speaking, is that a message from Mike Pence that people who are going to vote in the Republican primary and in New Hampshire and in other places interested in in 2023? If they are, they're not appearing so yet. I mean, he's trying to make them interested in that again. He's trying to essentially remake the Republican party to the pre-Trump era. That's a tall order. That's a very tall order. And you saw the response from some of his rivals, including of a V.A. Kramaswamy, who went after him aggressively. But look, this is one of his arguments. But one thing he does potentially have going for him are those independent voters in New Hampshire. There was a town hall that Scott Brown, former senator, held for Mike Pence on Monday night in New Hampshire. And one independent voter used to be a Republican. He left the party after January 6th, was thrilled with what former Vice President Mike Pence had. So there is a market, a lane, but boy, it's a pretty narrow one. Because in New Hampshire, you can. Independence can vote in the Republican primary. You can vote in the Republican primary. You mentioned Vivek Kramaswamy. This is what he said about the push that Mike Pence is doing, not just on CNN, but it was a speech in New Hampshire. It was an op-ed in The Wall Street Journal saying that the populism in the GOP is wrongheaded. Kramaswamy said, it's not 1980 anymore. It's painful to watch old school Republicans recite slogans they memorized in a bygone era. It's almost as if candidates like Mike Pence just stepped out of their DeLoreans and awoke from deep slumber to realize the world and what voters care about isn't what it was 40 years ago. He obviously saw back to the future. Obviously, that was his DeLorean reference since he is still a millennial. I will say that 40 years ago is a stretch. I mean, we're talking about the bygone era. This is the era before Donald Trump. This is before 2016 Republican parties. Not talking, you know, when they reference Reagan, they're not referencing Reagan as just because of the time period. They're talking about the old Republican Party, which is something that we have all reported on extensively. And I think this cycle in particular was one in which we were all looking to see if you have an open primary with Republicans and you have some of these Republicans who are from that era, the traditional Republican conservative party, is there a large enough group within the Republican Party to get behind one of those candidates? And right now the answer is still no. When you look at the party, the party is Trump's party. It has shifted. And that's really what the argument here is from Vivek Ramaswamy. It's not a bygone era about the 80s. It's about the fact that the Republican Party is just a fundamentally different party now. And it is still led by Donald Trump. OK, everybody stand by a predictable question, but an especially delicate one for Kamala Harris. Her answer next. Today a new interview with Kamala Harris and a familiar question, but an answer that carries extra consequence this time around. Are you prepared to be commander in chief? Yes, I am, if necessary. But Joe Biden is going to be fine. And let me tell you something. I work with Joe Biden every day. The work that under Joe Biden's leadership, our administration has accomplished, is transformative. I think the American people most of all want a leader who actually gets things done. My panel is back with me now. What do you make of that answer and more broadly how she is shaping up to have a role in the reelection campaign? It's clear that Harris wants to defer to Biden and really reinforce the argument of this administration that he is vital and up to the job. At the same time, she also clearly wants to alleviate concerns that Republican candidates are trying to push that a Harris administration would be worse than a Biden administration. But there's also a tension of Harris talking about this at all. We've seen in our polling today and in general that there are other Democrats in the party who would prefer someone else other than Harris to succeed Biden. And we shouldn't be surprised that there are politicians who want to be the next president of the United States and Democratic politicians. That's what happens all the time. But that Harris, the sitting vice president, isn't the de facto choice is telling to the party's confidence in her. And it is true that the Republican candidates, most specifically Nikki Haley, is pounding away relentlessly at the notion that Kamala Harris could be president and you don't want that. She can do it in a way that most of her rivals can't because she's a woman. So she can make this argument and she is making it. She made it to repeatedly. I was with her in New Hampshire this week. She makes it. And look, what that really is a proxy for that President Biden's old, that they're liberals. There's a lot going on here, but there is no question that the vice president is at the center of attention from all different sides now. There's also a question if you play this out and if there would be another nominee to somehow replace President Biden, which isn't going to happen. She is still the leading person in that race. She's the vice president of the United States. So I think that is for all the discussion in Washington about how she may not be living up to things. There are people in the country, African-American voters, women voters, others, who like to see more of her. So whether she likes it or not, we are going to see more of her. And now she's abroad. When she comes back, she's got a swing stage tour. She's going to Virginia, North Carolina, Georgia, Wisconsin, Nevada, Arizona. So they're definitely putting her out there in the Biden re-election campaign. Thank you all. Appreciate it. Thank you for joining Inside Politics. CNN News Central starts after this."}, "podcast_summary": "In a recent podcast, CNN discussed the current mood in America regarding President Joe Biden. The podcast highlighted that there is deep-rooted dissatisfaction with the incumbent and doubts about his ability to perform the job. The approval rating for President Biden is down to 39%, with more than 60% of Americans disapproving of his performance. Within the Democratic Party, many voters would like to see a different candidate as the nominee. When asked about a potential Biden-Trump rematch, the poll showed a dead heat race with 47% support for each candidate. However, neither candidate has a strong favorability rating, with only 35% of Americans having a favorable view of both Biden and Trump. The podcast also discussed the controversy surrounding Joe Biden's son, Hunter Biden, and his business dealings. A majority of Americans believe that Joe Biden was involved in these dealings, and 42% think that he acted illegally. Additionally, 55% of Americans believe that Biden's actions related to the Hunter Biden probe have been inappropriate. The podcast also featured an interview with Republican presidential candidate Chris Christie, who criticized Trump and emphasized the need for an alternative candidate. However, polls show that Republican voters are still supportive of Trump, indicating a split within the party. Former Vice President Mike Pence also made headlines with his comments about the future of the Republican Party. Overall, the podcast highlighted the divisions within the American political landscape and the challenges faced by both parties.", "podcast_guest": "Chris Christie", "podcast_highlights": "- Highlight 1 of the podcast: \"Most Democratic voters hope for a change at the top of the ticket, and Americans don't take the president and his word when he talks about his son, Hunter.\"\n- Highlight 2 of the podcast: \"Overall, his approval rating is down now at 39% approved. So more than six in 10 Americans disapprove of the job he's doing.\"\n- Highlight 3 of the podcast: \"Two thirds of Democratic and Democratic leaning voters say that they would like a different candidate to be the Democratic nominee.\"\n- Highlight 4 of the podcast: \"49% say it's his age, 7% mental sharpness, 7% health, ability to do the job.\"\n- Highlight 5 of the podcast: \"47% Trump, 46% Biden. This is the first time we at CNN this cycle have tested a general election matchup like this. And this is no clear leader, well within the margin of error, a real dead heat contest.\""}